test/fixtures/get_customer_success.json

HTTP/1.1 200 OK
Content-Length: 1056
Content-Type: application/json; odata.metadata=minimal; odata.streaming=true
Server: Microsoft-HTTPAPI/2.0
Access-Control-Allow-Headers: Origin, X-Requested-With, Authorization
Access-Control-Allow-Origin: *
Access-Control-Allow-Credentials: true
x-ms-correlation-id: 39ddf607-074a-4b88-bb87-31b69178878c
OData-Version: 4.0
request-id: 1a0fc46d-d7af-47c8-aeec-6d3eff29b242
x-content-type-options: nosniff
Access-Control-Expose-Headers: Date
Access-Control-Expose-Headers: Content-Length
Access-Control-Expose-Headers: Server
Access-Control-Expose-Headers: OData-Version
Access-Control-Expose-Headers: x-ms-correlation-id
Date: Wed, 24 Oct 2018 01:33:46 GMT
Connection: close

{"@odata.context":"https://api.businesscentral.dynamics.com/v1.0/fivesenses.com.au/api/beta/$metadata#companies(7fc353e6-de7a-41aa-a0e9-722507d6bdf1)/customers/$entity","@odata.etag":"W/\"JzQ0OzJnSU1YRGpnT1h3Mnl4akRDR2NFVmNqVnBabEcyWi9oRStqVEdsUStjcTg9MTswMDsn\"","id":"200c1a83-de2e-4214-b6e5-85d48333e37b","number":"C00010","displayName":"Chicken Feet","type":"Company","phoneNumber":"","email":"chantelle.mueller@fivesenses.com.au","website":"","taxLiable":false,"taxAreaId":"3b3314d6-4da8-4c51-b272-a0e33e679de6","taxAreaDisplayName":"Domestic customers and vendors","taxRegistrationNumber":"","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"5b39c03c-c538-47c2-a7d4-46d395326eeb","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","balance":365,"overdueAmount":365,"totalSalesExcludingTax":317.39,"lastModifiedDateTime":"2018-10-24T01:32:29.457Z","address":{"street":"","city":"","state":"","countryLetterCode":"","postalCode":""}}
