test/fixtures/patch_customer_success.json

{"@odata.context":"https://api.businesscentral.dynamics.com/v1.0/fivesenses.com.au/api/beta/$metadata#companies(7fc353e6-de7a-41aa-a0e9-722507d6bdf1)/customers/$entity","@odata.etag":"W/\"JzQ0O1JpdzI0TmU4NEpRS0R6cHAzTkVBdHpxYXorc0VLbnJ4OVQyTFJjclREeG89MTswMDsn\"","id":"200c1a83-de2e-4214-b6e5-85d48333e37b","number":"C00010","displayName":"Bill Example","type":"Company","phoneNumber":"","email":"chantelle.mueller@fivesenses.com.au","website":"","taxLiable":false,"taxAreaId":"3b3314d6-4da8-4c51-b272-a0e33e679de6","taxAreaDisplayName":"Domestic customers and vendors","taxRegistrationNumber":"","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"5b39c03c-c538-47c2-a7d4-46d395326eeb","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","balance":365,"overdueAmount":365,"totalSalesExcludingTax":317.39,"lastModifiedDateTime":"2018-10-24T01:34:06.11Z","address":{"street":"","city":"","state":"","countryLetterCode":"","postalCode":""}}
